const [
  msgRainHigh,
  msgTempAbove15,
  msgTempBelow15,
  msgTempBelow10
] = [
  'আবহাওয়া পূর্বাভাস অনুযায়ী, %div জেলার %upz উপজেলায় আগামী ৫ দিনের মধ্যে ভারী বৃষ্টিপাতের সম্ভাবনা রয়েছে। ফলে, ফল আর্মিওয়ার্ম দ্বারা ফসল আক্রান্ত হবার সম্ভাবনা কম। আগামী কয়েকদিন কীটনাশকের প্রয়োগ থেকে বিরত থাকার জন্য অনুরোধ জানানো যাচ্ছে। ধন্যবাদ।',
  'আবহাওয়া পূর্বাভাস অনুযায়ী, %div জেলার %upz উপজেলায় আগামী ৫ দিনের মধ্যে তাপমাত্রা ১০° সেলসিয়াসের নীচে নামার সম্ভাবনা রয়েছে। ফলে, ফল আর্মিওয়ার্ম দ্বারা ফসল আক্রান্ত হবার সম্ভাবনা কম। আগামী কয়েকদিন কীটনাশকের প্রয়োগ থেকে বিরত থাকার জন্য অনুরোধ জানানো যাচ্ছে। ধন্যবাদ।',
  'আবহাওয়া পূর্বাভাস অনুযায়ী, %div জেলার %upz উপজেলায় আগামী ৫ দিনের মধ্যে তাপমাত্রা ১৫° সেলসিয়াসের নীচে নামার সম্ভাবনা রয়েছে। ফলে, ফল আর্মিওয়ার্ম দ্বারা ফসল আক্রান্ত হবার সম্ভাবনা কম। ধন্যবাদ।',
  'আবহাওয়া পূর্বাভাস অনুযায়ী, %div জেলার %upz উপজেলায় আগামী ৫ দিনের দৈনিক সর্বনিম্ন তাপমাত্রা ১৫° সেলসিয়াসের উপরে থাকার সম্ভাবনা রয়েছে। ফলে, ফল আর্মিওয়ার্ম দ্বারা ফসল আক্রান্ত হবার সম্ভাবনা বেশি। যথাযথভাবে মনিটরিং কার্যক্রম পরিচালনা করে যাওয়ার জন্য অনুরোধ জানানো যাচ্ছে। ধন্যবাদ।'
]

module.exports = ({ area, prec, t2 }) => {
  const
    { adm2, adm3 } = area,
    precMax = Math.max(...prec),
    t2Min = Math.min(...t2),
    msg = precMax > 25 ? msgRainHigh
      : t2Min < 10 ? msgTempBelow10
        : t2Min < 15 ? msgTempBelow15
          : t2Min >= 15 ? msgTempAbove15
            : ''

  return msg.replace('%div', adm2).replace('%upz', adm3)
}
